students = [[1,'홍길동',100,100,99,299,99.67,1],
            [2,'유관순',99,99,98,296,98.67,1],
            [3,'이순신',80,80,81,241,80.33,1],
            [4,'김구',100,100,90,290,96.67,1],
            [5,'김유신',90,70,50,210,70.0,1]]   

#   등수처리    합계로 비교하기
while True:
    choice = input('등수처리를 실행하시겠습니까?(1.실행, 0.취소)')
    if choice == '0':
        print('등수처리를 취소하셨습니다.')
        break
    else:
        #   등수처리 진행
        for i_stu in students:
            no = 1                          #   초기화
            for j_stu in students:
                if i_stu[5] < j_stu[5]:     #   각각의 총합 비교
                    no += 1                 #   비교대상 총합이 더 크면 1 증가
            i_stu[7] = no                       #   등수 위치에 no저장
    print('등수처리가 완료되었습니다.')
    print('-'*40)
    print('[등수확인]')
    print(students)
        